noteorious-rails/app/controllers/notes_controller.rb

  def index
    @notes = Note.all(:order => 'updated_at DESC')
---
SELECT * FROM "notes" ORDER BY updated_at DESC

  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("updated_at", "content", "created_at") VALUES('2009-06-24 18:53:52', 'Hey, this is a note', '2009-06-24 18:53:52')